import sys, os
from colorama import Fore, Back, Style

num_tabs = 4

def get_dir(cur_path: str, cur_dir: str = "", level: int = 0) -> int:
    path = cur_path + cur_dir + "\\"
    path_list = os.listdir(path)
    files = []
    dirs = []
    for x in path_list: #формуємо окремо список з файлами і окремо з каталогами, щоб файли вивести в першу чергу, до рекурсії
        if os.path.isfile(os.path.join(path, x)):
            files.append(x)
        else:
            dirs.append(x)
    #print(f"all files in current dir: {files}")

    print_dirs(cur_dir+"\\", level)
    print_files(files, level+1)
    if len(dirs):
        [get_dir(path, dir, level+1) for dir in dirs]
    else:
        return 0

def print_dirs(dirname: str, level: int):
    spaces = level * num_tabs * " "
    print(Fore.BLUE + spaces+dirname)
    print(Style.RESET_ALL, end='')

def print_files(filenames: list[str], level: int):

    spaces = level * num_tabs * " "
    for filename in filenames:
        print(Fore.YELLOW + spaces+filename)
    print(Style.RESET_ALL, end='')

def main():
    path = ""
    if len(sys.argv) > 1:
        path = sys.argv[1]  #command line
    else:
        path = "..\\"   #debug only
    print(os.listdir(path))
    print(get_dir(path))


if __name__ == "__main__":
    main()





# Третє завдання (не обов'язкове)

# Розробіть скрипт, який приймає шлях до директорії в якості аргументу командного рядка і візуалізує структуру цієї директорії, виводячи імена всіх піддиректорій та файлів. Для кращого візуального сприйняття, імена директорій та файлів мають відрізнятися за кольором.

# Вимоги до завдання:
#     Створіть віртуальне оточення Python для ізоляції залежностей проєкту.
#     Скрипт має отримувати шлях до директорії як аргумент при запуску. Цей шлях вказує, де знаходиться директорія, структуру якої потрібно відобразити.
#     Використання бібліотеки colorama для реалізації кольорового виведення.
#     Скрипт має коректно відображати як імена директорій, так і імена файлів, використовуючи рекурсивний спосіб обходу директорій (можна, за бажанням, використати не рекурсивний спосіб).
#     Повинна бути перевірка та обробка помилок, наприклад, якщо вказаний шлях не існує або він не веде до директорії.

# Рекомендації для виконання:
#     Спочатку встановіть бібліотеку colorama. Для цього створіть та активуйте віртуальне оточення Python, а потім встановіть пакет за допомогою pip.
#     Використовуйте модуль sys для отримання шляху до директорії як аргументу командного рядка.
#     Для роботи з файловою системою використовуйте модуль pathlib.
#     Забезпечте належне форматування виводу, використовуючи функції colorama.

# Критерії оцінювання:
#     Створення та використання віртуального оточення.
#     Правильність отримання та обробки шляху до директорії.
#     Точність виведення структури директорії.
#     Коректне застосування кольорового виведення за допомогою colorama.
#     Якість коду, включаючи читабельність, структурування та коментарі.

# Приклад використання:
# Якщо виконати скрипт та передати йому абсолютний шлях до директорії як параметр.

# python hw03.py /шлях/до/вашої/директорії

# Це призведе до виведення в терміналі списку всіх піддиректорій та файлів у вказаній директорії з використанням різних кольорів для піддиректорій та файлів, що полегшить візуальне сприйняття файлової структури.

# Для директорії зі наступною структурою